package hong;

/*
 * [Lv3] 길 찾기 게임 (42892)
 *
 * 문제: https://school.programmers.co.kr/learn/courses/30/lessons/42892
 *
 * 각 노드의 좌표 (x, y)가 담긴 nodeinfo가 주어집니다.
 * 이 좌표들로 이진트리를 구성합니다. 이진트리의 조건은 다음과 같습니다.
 * - 트리를 구성하는 모든 노드의 x, y 좌표 값은 정수
 * - 모든 노드는 서로 다른 x값을 가진다
 * - 같은 레벨에 있는 노드는 같은 y 좌표를 가진다
 * - 자식 노드의 y 값은 항상 부모 노드보다 작다
 * - 임의의 노드 V의 왼쪽 서브 트리에 있는 모든 노드의 x값은 V의 x값보다 작다
 * - 임의의 노드 V의 오른쪽 서브 트리에 있는 모든 노드의 x값은 V의 x값보다 크다
 *
 * 이 트리를 전위 순회, 후위 순회한 결과를 노드 번호로 담은 2차원 배열을 리턴하세요.
 *
 * 제한사항:
 * - nodeinfo는 1 이상 10,000 이하인 노드들의 좌표가 노드 번호 순서대로 들어있는 배열
 * - nodeinfo[i]는 i+1번 노드의 좌표이며 [x축 좌표, y축 좌표] 순
 * - 모든 노드의 좌표 값은 0 이상 100,000 이하인 정수
 * - 트리의 깊이가 1,000 이하인 경우만 입력으로 주어진다
 * - 모든 노드의 x값은 서로 다르다
 *
 * 입출력 예시:
 * - 입력: nodeinfo = [[5,3],[11,5],[13,3],[3,5],[6,1],[1,3],[8,6],[7,2],[2,2]]
 *   출력: [[7,4,6,9,1,8,5,2,3],[9,6,5,8,1,4,3,2,7]]
 */
public class 길찾기게임 {
    public int[][] solution(int[][] nodeinfo) {
        // TODO: 구현
        return new int[0][0];
    }
}
